#pandas are very useful library in python.
#they are used to minuplate data and clean data.
#initially they have two primary data structure. series and dataframe.

#dataframe is two dimensional whereas pandas series is one dimensional.
dataframe can be used for data manupilation, it is hatrogeneous having a diverse content type.

In [ ]:
# series in pandas.
# it can hold any data type.
import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series: \n",series) # 0 1 2 3 4 5 are the indexing, 1 2 3 4 5 are now in series.

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# series in dictionary
dict={'a':1,'b':2,'c':3,'d':4,'e':5,'f':6} # now a b c.. are the index of numbers
series_dict=pd.Series(dict)
print("series of dict:\n",series_dict)
print("Type:",type(series_dict))

series of dict:
 a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64
Type: <class 'pandas.core.series.Series'>

In [6]:
data=[1,2,3]
index=[10,20,30] # setting manual index is also possible
pd.Series(data,index=index)

10    1
20    2
30    3
dtype: int64

In [11]:
# jumping towards creating dataframe through dictionary of list.
dict1={'Name':["afraz","abdullah","faiz"],"Age":[19,25,20],"City":["karahi","karachi","chau"],"gender":["male","male","male"]}
df=pd.DataFrame(dict1)
print(df)
print(type(df))
import numpy as np
# we can also use numpy for this to see in array form
nn=np.array(df)
print("\nUsing numpy arrays:\n",nn)

       Name  Age     City gender
0     afraz   19   karahi   male
1  abdullah   25  karachi   male
2      faiz   20     chau   male
<class 'pandas.core.frame.DataFrame'>

Using numpy arrays:
 [['afraz' 19 'karahi' 'male']
 ['abdullah' 25 'karachi' 'male']
 ['faiz' 20 'chau' 'male']]

In [13]:
# same thing but doing it with a list of dictionaries
lsst=[{'Name':"afraz","Age":19,"City":"Karachi","Gender":"Male"},
      {"Name":"Abdullah","Age":25,"City":"Karachi","Gender":"Male"},
      {"Name":"Faiz","Age":25,"City":"Chou","Gender":"Male"}]
dflsst=pd.DataFrame(lsst)
print("Data Frame As List of Dictionaries:\n",dflsst)
print("\nType:\n",type(dflsst))
nn=np.array(dflsst)
print("\nUsing numpy arrays:\n",nn)

Data Frame As List of Dictionaries:
        Name  Age     City Gender
0     afraz   19  Karachi   Male
1  Abdullah   25  Karachi   Male
2      Faiz   25     Chou   Male

Type:
 <class 'pandas.core.frame.DataFrame'>

Using numpy arrays:
 [['afraz' 19 'Karachi' 'Male']
 ['Abdullah' 25 'Karachi' 'Male']
 ['Faiz' 25 'Chou' 'Male']]

In [ ]:
import pandas as pd
df=pd.read_csv('sales_txt.csv')
dfsales=pd.DataFrame(df) # but we are converting here data frame into dataframe we can also directly print df asnwer will be same. as reading csv through pandas directly auto convert to dataframe.
dfsales

       Name  Age     City  gender blood group   product     sales
0     Afraz   19  karachi    male           a  computer  moderate
1  abdullah   25  karachi    male           a       oil       low
2     majid   59  karachi    male           a      none       low
3      faiz   20     chou    male           b      none       low
4   shanzey   22  karachi  female           a    makeup      high

#(Acessing of data from df)
 now until i change the main heading.

In [99]:
#acessing specific elements 

print(df['Name']) #accessing directly through column name 
print(df['blood group'])

0       Afraz
1    abdullah
2       majid
3        faiz
4     shanzey
Name: Name, dtype: object
0    a
1    a
2    a
3    b
4    a
Name: blood group, dtype: object

In [100]:
#accessing form index
# using loc mean location
print(df.loc[0]) # loc is row index

Name              Afraz
Age                  19
City            karachi
gender             male
blood group           a
product        computer
sales          moderate
Name: 0, dtype: object

In [101]:
print(df.iloc[0]) # iloc means column index

Name              Afraz
Age                  19
City            karachi
gender             male
blood group           a
product        computer
sales          moderate
Name: 0, dtype: object

In [102]:
print(df.loc[0][0]) # row index loc
print(df.iloc[0][1]) #column index iloc
print(df.iloc[0][0])

Afraz
19
Afraz

C:\Users\NINJA-C7\AppData\Local\Temp\ipykernel_1796\1841154323.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[0][0]) # row index loc
C:\Users\NINJA-C7\AppData\Local\Temp\ipykernel_1796\1841154323.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[0][1]) #column index iloc
C:\Users\NINJA-C7\AppData\Local\Temp\ipykernel_1796\1841154323.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[0][0])

In [103]:
df

       Name  Age     City  gender blood group   product     sales
0     Afraz   19  karachi    male           a  computer  moderate
1  abdullah   25  karachi    male           a       oil       low
2     majid   59  karachi    male           a      none       low
3      faiz   20     chou    male           b      none       low
4   shanzey   22  karachi  female           a    makeup      high

In [104]:
# acessing specific element using at
print(df.at[1,'Age']) # 1 is row index , age is column name not index index is 2
print(df.iat[1,1]) # ita is only used when you are giving your both row and column index not column name like above .

25
25

# (Data manupilation) until i change the main heading

In [105]:

df['salary']=[5000,6000,4000,8000,9000]
df
# now another column is added for each row

       Name  Age     City  gender blood group   product     sales  salary
0     Afraz   19  karachi    male           a  computer  moderate    5000
1  abdullah   25  karachi    male           a       oil       low    6000
2     majid   59  karachi    male           a      none       low    4000
3      faiz   20     chou    male           b      none       low    8000
4   shanzey   22  karachi  female           a    makeup      high    9000

In [106]:
df.drop('salary')

KeyError: "['salary'] not found in axis"

In [107]:
df
# above df.drop('salary') is not found but it exist the problem is that there is an axis which is zero 
#axis=0 do it axis=1 means now it will search the salary column in above row.

       Name  Age     City  gender blood group   product     sales  salary
0     Afraz   19  karachi    male           a  computer  moderate    5000
1  abdullah   25  karachi    male           a       oil       low    6000
2     majid   59  karachi    male           a      none       low    4000
3      faiz   20     chou    male           b      none       low    8000
4   shanzey   22  karachi  female           a    makeup      high    9000

In [108]:
df.drop('salary',axis=1)

       Name  Age     City  gender blood group   product     sales
0     Afraz   19  karachi    male           a  computer  moderate
1  abdullah   25  karachi    male           a       oil       low
2     majid   59  karachi    male           a      none       low
3      faiz   20     chou    male           b      none       low
4   shanzey   22  karachi  female           a    makeup      high

In [109]:
df # but after deleting it still exist . problem is to make it permanant add in above statement ,inplace=True.
# this will make it permanant.

       Name  Age     City  gender blood group   product     sales  salary
0     Afraz   19  karachi    male           a  computer  moderate    5000
1  abdullah   25  karachi    male           a       oil       low    6000
2     majid   59  karachi    male           a      none       low    4000
3      faiz   20     chou    male           b      none       low    8000
4   shanzey   22  karachi  female           a    makeup      high    9000

In [110]:

df.drop('salary',axis=1,inplace=True)

In [111]:
df # now permanant deleted salary

       Name  Age     City  gender blood group   product     sales
0     Afraz   19  karachi    male           a  computer  moderate
1  abdullah   25  karachi    male           a       oil       low
2     majid   59  karachi    male           a      none       low
3      faiz   20     chou    male           b      none       low
4   shanzey   22  karachi  female           a    makeup      high

In [112]:
# now after 1 year every body age increase by 1
# adding age to every person age
df['Age']=df['Age']+1

In [113]:
df

       Name  Age     City  gender blood group   product     sales
0     Afraz   20  karachi    male           a  computer  moderate
1  abdullah   26  karachi    male           a       oil       low
2     majid   60  karachi    male           a      none       low
3      faiz   21     chou    male           b      none       low
4   shanzey   23  karachi  female           a    makeup      high

In [114]:
df.drop(0)

       Name  Age     City  gender blood group product sales
1  abdullah   26  karachi    male           a     oil   low
2     majid   60  karachi    male           a    none   low
3      faiz   21     chou    male           b    none   low
4   shanzey   23  karachi  female           a  makeup  high

In [115]:
df

       Name  Age     City  gender blood group   product     sales
0     Afraz   20  karachi    male           a  computer  moderate
1  abdullah   26  karachi    male           a       oil       low
2     majid   60  karachi    male           a      none       low
3      faiz   21     chou    male           b      none       low
4   shanzey   23  karachi  female           a    makeup      high

In [ ]:
df.drop(0,inplace=True) # axis was only for deleting the column like salary.

In [117]:
df

       Name  Age     City  gender blood group product sales
1  abdullah   26  karachi    male           a     oil   low
2     majid   60  karachi    male           a    none   low
3      faiz   21     chou    male           b    none   low
4   shanzey   23  karachi  female           a  makeup  high

In [119]:
df.describe() # statical summary

             Age
count   4.000000
mean   32.500000
std    18.448125
min    21.000000
25%    22.500000
50%    24.500000
75%    34.500000
max    60.000000